Revit 2024 API
BuiltInFailures.ColumnFailures.ColumnTopBelowBaseFailure Property
 The column top can't be moved below its base.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ColumnTopBelowBaseFailure { get; }
Visual Basic
Public Shared ReadOnly Property ColumnTopBelowBaseFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ColumnTopBelowBaseFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace